Revit 2024 API
BuiltInFailures.PointFailures.HostMeasurementError Property
 Invalid host curve measurement type or value or justification
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HostMeasurementError { get; }
Visual Basic
Public Shared ReadOnly Property HostMeasurementError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HostMeasurementError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace